# üéì Examen Final: SQL y Gesti√≥n de Datos (15 Puntos)

**Contexto:** Eres el Data Steward de la **Universidad Santo Tom√°s**. Se acerca el cierre de semestre y la decanatura requiere una gesti√≥n intensiva de la base de datos: desde registrar ofertas de √∫ltima hora hasta generar los indicadores finales de deserci√≥n y carga acad√©mica.

**Instrucciones:**
* Aseg√∫rate de tener el archivo **`universidad.db`** en esta misma carpeta.
* Cada punto tiene un valor de **1.0** sobre 15.
* Usa `conn.commit()` despu√©s de las sentencias de modificaci√≥n (INSERT/UPDATE/DELETE).
* Usa `pd.read_sql_query` para las consultas de selecci√≥n (SELECT).

---

In [14]:
# üõ†Ô∏è CONFIGURACI√ìN INICIAL
import sqlite3
import pandas as pd
import os

db_filename = 'C:/Users/Sonia/Universidades/Datos/universidad.db'

if not os.path.exists(db_filename):
    print(f"‚ö†Ô∏è ERROR: No encuentro '{db_filename}'. S√∫belo a esta carpeta.")
else:
    conn = sqlite3.connect(db_filename)
    cursor = conn.cursor()
    cursor.execute("PRAGMA foreign_keys = ON;")
    print(f"‚úÖ Conectado a '{db_filename}'. ¬°Listo para el examen!")

‚úÖ Conectado a 'C:/Users/Sonia/Universidades/Datos/universidad.db'. ¬°Listo para el examen!

## üìù Secci√≥n 1: Gesti√≥n Acad√©mica (DML) - 5 Puntos

**1. Apertura de Curso (INSERT)**
La facultad abre un nuevo curso electivo.
* Inserta en la tabla `Cursos`:
    * Nombre: **'Big Data & AI'**
    * Cr√©ditos: **5**
    * ID Profesor: **20**

**2. Nuevo Ingreso (INSERT)**
Registra a un nuevo estudiante en la tabla `Estudiantes`:
    * Nombre: **'Lionel'**
    * Apellido: **'Messi'**
    * Email: **'lio@usta.edu.co'**
    * Fecha Ingreso: '2024-11-25'

**3. Matr√≠cula Manual (INSERT)**
Matricula al estudiante 'Lionel Messi' en el curso de 'Big Data & AI' que acabas de crear.
* *Pista:* Necesitar√°s averiguar primero qu√© ID le asign√≥ la base de datos a Lionel y al curso.
* Nota final: `NULL`.

**4. Correcci√≥n de Cr√©ditos (UPDATE)**
El comit√© curricular decidi√≥ que 5 cr√©ditos es demasiado.
* Actualiza el curso 'Big Data & AI' para que tenga **3 cr√©ditos**.

**5. Retiro Definitivo (DELETE)**
El estudiante con **ID = 10** se retira de la universidad.
* Elimina todos sus registros de la tabla `Inscripciones` (para mantener la integridad, primero borramos sus clases).

In [48]:
def ejecutar_sql(query, conexion=conn):
  """
  Toma una consulta SQL, la ejecuta y devuelve el resultado
  en una tabla de pandas para una visualizaci√≥n clara.
  """
  df = pd.read_sql_query(query, conexion)
  # Usamos display() porque en Colab presenta las tablas de forma m√°s elegante.
  display(df)

ejecutar_sql("Select * FROM Cursos")
ejecutar_sql("Select * FROM Estudiantes")
ejecutar_sql("Select * FROM Profesores")
ejecutar_sql("Select * FROM Inscripciones")

     id_curso       nombre_curso  creditos  id_profesor
0           1     Bases de Datos         4            2
1           2  Econom√≠a Avanzado         5            1
2           3          Ingl√©s II         4            9
3           4        Econom√≠a II         5           13
4           5      Arte Aplicado         4           15
..        ...                ...       ...          ...
96         97  Econom√≠a Avanzado         2           10
97         98   Derecho Avanzado         3           14
98         99         Ingl√©s III         3           36
99        100          C√°lculo I         2           25
100       105      Big Data & AI         5           20

[101 rows x 4 columns]

,id_estudiante,nombre,apellido,email,fecha_ingreso
0,1,Diego,Martinez,diego.martinez42@usantotomas.edu.co,2024-01-20
1,2,Lucia,Zainea,lucia.zainea87@usantotomas.edu.co,2024-01-20
2,3,Ricardo,Mendoza,ricardo.mendoza77@usantotomas.edu.co,2024-01-20
3,4,Ana,Rios,ana.rios10@usantotomas.edu.co,2024-01-20
4,5,Ana,Navarro,ana.navarro48@usantotomas.edu.co,2024-01-20
...,...,...,...,...,...
496,497,Jorge,Romero,jorge.romero11@usantotomas.edu.co,2024-01-20
497,498,Laura,Cardenas,laura.cardenas99@usantotomas.edu.co,2024-01-20
498,499,Felipe,Castillo,felipe.castillo36@usantotomas.edu.co,2024-01-20
499,500,David,Ruiz,david.ruiz90@usantotomas.edu.co,2024-01-20
500,501,Lionel,Messi,lio@usta.edu.co,2024-11-25

    id_profesor     nombre   apellido         especialidad
0             1      David      Silva                 Arte
1             2     Andres       Rios             Biolog√≠a
2             3      Marta       Maya                   IA
3             4     Andres    Navarro             Econom√≠a
4             5      David       Mora    Matem√°ticas Puras
5             6      Diego   Castillo              Qu√≠mica
6             7    Nicolas    Mendoza            Filosof√≠a
7             8      Laura    Jimenez                   IA
8             9        Ana       Diaz          Estad√≠stica
9            10     Hector     Torres             Historia
10           11       Ivan      Gomez                 Arte
11           12     Hector    Navarro    Matem√°ticas Puras
12           13    Nicolas     Ortega    Matem√°ticas Puras
13           14    Nicolas      Gomez    Matem√°ticas Puras
14           15      Lucia     Romero          Estad√≠stica
15           16      Jorge     Romero               F√≠sica
16           17    Mariana   Martinez             Biolog√≠a
17           18    Valeria       Maya               F√≠sica
18           19      Marta       Ruiz            Filosof√≠a
19           20     Camila   Martinez             Econom√≠a
20           21      Oscar   Cardenas              Derecho
21           22     Felipe       Diaz              Derecho
22           23    Valeria     Zainea                   IA
23           24    Valeria     Pineda             Econom√≠a
24           25      Lucia      Mu√±oz              Qu√≠mica
25           26      Lucia      Silva                   IA
26           27    Beatriz     Zainea            Filosof√≠a
27           28      Paula   Castillo    Matem√°ticas Puras
28           29       Ivan     Romero  Ingenier√≠a de Datos
29           30    Daniela  Gutierrez  Ingenier√≠a de Datos
30           31      Kevin    Navarro              Qu√≠mica
31           32   Fernando       Diaz               F√≠sica
32           33  Valentina       Diaz                   IA
33           34      Marta     Ortega                   IA
34           35    Beatriz     Torres             Historia
35           36    Ricardo      Perez  Ingenier√≠a de Datos
36           37        Ana    Jimenez              Qu√≠mica
37           38      Mateo     Ortega              Derecho
38           39     Gloria     Ortega             Historia
39           40  Valentina      Lopez            Filosof√≠a
40           41      Lucia       Rios                 Arte
41           42    Ricardo       Sosa              Qu√≠mica
42           43      Mateo    Jimenez              Derecho
43           44    Esteban       Sosa               F√≠sica
44           45      David       Rios            Filosof√≠a
45           46   Fernando       Ruiz               F√≠sica
46           47   Fernando     Pineda             Econom√≠a
47           48     Camila    Jimenez              Derecho
48           49      Laura     Torres               F√≠sica
49           50    Nicolas    Jimenez             Historia

      id_inscripcion  id_estudiante  id_curso fecha_inscripcion  nota_final
0                  1             69         1        2024-02-01         3.8
1                  2            298         1        2024-02-01         4.5
2                  3            364         1        2024-02-01         1.9
3                  4            116         1        2024-02-01         2.5
4                  5            261         1        2024-02-01         2.5
...              ...            ...       ...               ...         ...
2022            2023            500        40        2024-02-01         2.4
2023            2024            500        38        2024-02-01         1.8
2024            2025            500        60        2024-02-01         2.9
2025            2026            500         8        2024-02-01         2.1
2026            2027            500        86        2024-02-01         2.6

[2027 rows x 5 columns]

In [55]:
# 1. Insertar curso si no existe
cursor.execute("SELECT id_curso FROM Cursos WHERE nombre_curso = 'Big Data & AI'")
curso = cursor.fetchone()

if curso is None:
    cursor.execute("""
        INSERT INTO Cursos (nombre_curso, creditos, id_profesor)
        VALUES ('Big Data & AI', 5, 20)
    """)
    conn.commit()

    cursor.execute("SELECT id_curso FROM Cursos WHERE nombre_curso = 'Big Data & AI'")
    curso = cursor.fetchone()
    print("Curso insertado con ID:", curso[0])
else:
    print("El curso ya existe con ID:", curso[0])

id_curso = curso[0]


# 2. Insertar estudiante si no existe
cursor.execute("SELECT id_estudiante FROM Estudiantes WHERE email = ?", ("lio@usta.edu.co",))
est = cursor.fetchone()

if est is None:
    cursor.execute("""
        INSERT INTO Estudiantes (nombre, apellido, email, fecha_ingreso)
        VALUES ('Lionel', 'Messi', 'lio@usta.edu.co', '2024-11-25')
    """)
    conn.commit()

    cursor.execute("SELECT id_estudiante FROM Estudiantes WHERE email = 'lio@usta.edu.co'")
    est = cursor.fetchone()
    print("Estudiante creado con ID:", est[0])
else:
    print("El estudiante ya existe con ID:", est[0])

id_estudiante = est[0]


# 3. Matricular estudiante sin duplicar registro
cursor.execute("""
    SELECT 1 FROM Inscripciones
    WHERE id_estudiante = ? AND id_curso = ?
""", (id_estudiante, id_curso))

ya_existe = cursor.fetchone()

if ya_existe:
    print("Lionel ya est√° inscrito en este curso. No se insert√≥ nada.")
else:
    cursor.execute("""
        INSERT INTO Inscripciones (id_estudiante, id_curso, nota_final)
        VALUES (?, ?, NULL)
    """, (id_estudiante, id_curso))
    conn.commit()
    print(" Lionel fue matriculado correctamente.")

#4
# Verificar si el curso sigue con cr√©ditos incorrectos
cursor.execute("""
SELECT creditos 
FROM Cursos 
WHERE nombre_curso = 'Big Data & AI'
""")

dato = cursor.fetchone()

if dato is None:
    print("El curso no existe.")
else:
    creditos_actuales = dato[0]
    if creditos_actuales == 3:
        print("El curso ya tiene 3 cr√©ditos. No se hizo ning√∫n cambio.")
    else:
        cursor.execute("""
        UPDATE Cursos
        SET creditos = 3
        WHERE nombre_curso = 'Big Data & AI'
        """)
        conn.commit()
        print("Cr√©ditos actualizados correctamente.")

#5
cursor.execute("SELECT 1 FROM Estudiantes WHERE id_estudiante = 10")
existe = cursor.fetchone()
if existe:
    cursor.execute("""
    DELETE FROM Inscripciones
    WHERE id_estudiante = 10
    """)    
    conn.commit()
    cursor.execute("""
    DELETE FROM Estudiantes
    WHERE id_estudiante = 10
    """)    
    conn.commit()
    print("Estudiante eliminado correctamente.")    
else:
    print("El estudiante con id 10 no existe. No se hizo ning√∫n cambio.")

El curso ya existe con ID: 105
El estudiante ya existe con ID: 501
Lionel ya est√° inscrito en este curso. No se insert√≥ nada.
El curso ya tiene 3 cr√©ditos. No se hizo ning√∫n cambio.
El estudiante con id 10 no existe. No se hizo ning√∫n cambio.

## üîç Secci√≥n 2: Consultas SQL (Analysis) - 6 Puntos

**6. M√©tricas Generales (Agregaci√≥n)**
Calcula y muestra:
* Cantidad total de estudiantes.
* Cantidad total de cursos ofertados.
* Promedio de cr√©ditos de los cursos.

**7. Auditor√≠a de Profesores (LEFT JOIN)**
Necesitamos ver la carga laboral completa.
* Lista **todos** los profesores (Nombre y Apellido) y el curso que dictan.
* **Condici√≥n:** Deben aparecer los profesores que **NO** tienen cursos asignados actualmente (valor NULL).

**8. Popularidad (GROUP BY)**
* Genera una lista con el `Nombre del Curso` y la **Cantidad de Estudiantes** inscritos en √©l.
* Ordena del m√°s popular al menos popular.

**9. Cursos Masivos (HAVING)**
* Basado en la consulta anterior, filtra para mostrar solo los cursos que tienen **m√°s de 20 estudiantes** inscritos.

**10. B√∫squeda Inteligente (Subconsulta)**
* Obt√©n el nombre y apellido de los estudiantes inscritos en el curso **"Bases de Datos"**.
* **Reto:** No uses el ID=1 directamente. Usa una subconsulta `(SELECT id_curso FROM Cursos WHERE nombre_curso = 'Bases de Datos')`.

**11. S√°bana de Notas (INNER JOIN M√∫ltiple)**
* Genera un reporte detallado que contenga:
    * Nombre Estudiante | Apellido Estudiante | Nombre Curso | Nota Final | Nombre Profesor

In [ ]:
# Espacio para Consultas SQL

# 6. M√©tricas Generales (Agregaci√≥n)
print("=" * 60)
print("6. M√âTRICAS GENERALES")
print("=" * 60)
query_6 = """
SELECT
    (SELECT COUNT(*) FROM Estudiantes) AS total_estudiantes,
    (SELECT COUNT(*) FROM Cursos) AS total_cursos,
    (SELECT AVG(creditos) FROM Cursos) AS promedio_creditos;
"""
ejecutar_sql(query_6)

# 7. Auditor√≠a de Profesores (LEFT JOIN)
print("\n" + "=" * 60)
print("7. AUDITOR√çA DE PROFESORES (LEFT JOIN)")
print("=" * 60)
query_7 = """
SELECT 
    p.nombre,
    p.apellido,
    c.nombre_curso
FROM Profesores p
LEFT JOIN Cursos c ON p.id_profesor = c.id_profesor
ORDER BY p.nombre;
"""
ejecutar_sql(query_7)

# 8. Popularidad (GROUP BY)
print("\n" + "=" * 60)
print("8. POPULARIDAD DE CURSOS (GROUP BY)")
print("=" * 60)
query_8 = """
SELECT 
    c.nombre_curso,
    COUNT(i.id_estudiante) AS cantidad_estudiantes
FROM Cursos c
LEFT JOIN Inscripciones i ON c.id_curso = i.id_curso
GROUP BY c.id_curso, c.nombre_curso
ORDER BY cantidad_estudiantes DESC;
"""
ejecutar_sql(query_8)

# 9. Cursos Masivos (HAVING)
print("\n" + "=" * 60)
print("9. CURSOS MASIVOS (M√ÅS DE 20 ESTUDIANTES)")
print("=" * 60)
query_9 = """
SELECT 
    c.nombre_curso,
    COUNT(i.id_estudiante) AS cantidad_estudiantes
FROM Cursos c
LEFT JOIN Inscripciones i ON c.id_curso = i.id_curso
GROUP BY c.id_curso, c.nombre_curso
HAVING COUNT(i.id_estudiante) > 20
ORDER BY cantidad_estudiantes DESC;
"""
ejecutar_sql(query_9)

# 10. B√∫squeda Inteligente (Subconsulta)
print("\n" + "=" * 60)
print("10. ESTUDIANTES EN 'BASES DE DATOS' (SUBCONSULTA)")
print("=" * 60)
query_10 = """
SELECT 
    e.nombre,
    e.apellido
FROM Estudiantes e
WHERE e.id_estudiante IN (
    SELECT i.id_estudiante 
    FROM Inscripciones i
    WHERE i.id_curso = (
        SELECT id_curso 
        FROM Cursos 
        WHERE nombre_curso = 'Bases de Datos'
    )
)
ORDER BY e.nombre;
"""
ejecutar_sql(query_10)

# 11. S√°bana de Notas (INNER JOIN M√∫ltiple)
print("\n" + "=" * 60)
print("11. S√ÅBANA DE NOTAS (INNER JOIN M√öLTIPLE)")
print("=" * 60)
query_11 = """
SELECT 
    e.nombre AS nombre_estudiante,
    e.apellido AS apellido_estudiante,
    c.nombre_curso,
    i.nota_final,
    p.nombre AS nombre_profesor
FROM Estudiantes e
INNER JOIN Inscripciones i ON e.id_estudiante = i.id_estudiante
INNER JOIN Cursos c ON i.id_curso = c.id_curso
INNER JOIN Profesores p ON c.id_profesor = p.id_profesor
ORDER BY e.apellido, e.nombre, c.nombre_curso;
"""
ejecutar_sql(query_11)

IndentationError: unexpected indent (3077642660.py, line 4)

## üìä Secci√≥n 3: Anal√≠tica con Python (Pandas) - 4 Puntos

**12. Carga de Datos**
* Ejecuta la consulta del punto 11 (S√°bana de Notas) y gu√°rdala en un DataFrame llamado `df_notas`.
* Muestra las primeras 5 filas y usa `.info()` para verificar tipos de datos.

**13. An√°lisis de Riesgo**
* Filtra el DataFrame `df_notas` para encontrar a los estudiantes que van perdiendo (Nota < 3.0).
* Gu√°rdalos en un nuevo DF `df_riesgo` y cuenta cu√°ntos son.

**14. Tabla Pivote (Cruce de Variables)**
* Crea una tabla din√°mica que muestre el **Promedio de Notas** (values) organizados por `Nombre Curso` (index) y `Nombre Profesor` (columns).

**15. Visualizaci√≥n (Gr√°fico)**
* Usando el DataFrame `df_notas`, crea un histograma o un gr√°fico de barras que muestre la distribuci√≥n de las notas finales.
* *Opcional:* Un gr√°fico de barras con el Top 5 de cursos con m√°s estudiantes.

In [ ]:
# Espacio para Python / Pandas

# 12. Carga de Datos - S√°bana de Notas
print("=" * 60)
print("12. CARGA DE DATOS - S√ÅBANA DE NOTAS")
print("=" * 60)
query_11_reload = """
SELECT 
    e.nombre AS nombre_estudiante,
    e.apellido AS apellido_estudiante,
    c.nombre_curso,
    i.nota_final,
    p.nombre AS nombre_profesor
FROM Estudiantes e
INNER JOIN Inscripciones i ON e.id_estudiante = i.id_estudiante
INNER JOIN Cursos c ON i.id_curso = c.id_curso
INNER JOIN Profesores p ON c.id_profesor = p.id_profesor
ORDER BY e.apellido, e.nombre, c.nombre_curso;
"""
df_notas = pd.read_sql_query(query_11_reload, conn)
print("\nPrimeras 5 filas del DataFrame:")
display(df_notas.head())
print("\nInformaci√≥n de tipos de datos:")
print(df_notas.info())

# 13. An√°lisis de Riesgo
print("\n" + "=" * 60)
print("13. AN√ÅLISIS DE RIESGO (Notas < 3.0)")
print("=" * 60)
df_riesgo = df_notas[df_notas['nota_final'] < 3.0]
print(f"\nEstudiantes en riesgo: {len(df_riesgo)}")
display(df_riesgo)

# 14. Tabla Pivote
print("\n" + "=" * 60)
print("14. TABLA PIVOTE - PROMEDIO DE NOTAS")
print("=" * 60)
df_pivote = df_notas.pivot_table(
    values='nota_final',
    index='nombre_curso',
    columns='nombre_profesor',
    aggfunc='mean'
)
display(df_pivote)

# 15. Visualizaci√≥n
print("\n" + "=" * 60)
print("15. VISUALIZACI√ìN - DISTRIBUCI√ìN DE NOTAS")
print("=" * 60)

import matplotlib.pyplot as plt
import seaborn as sns

# Configurar estilo
sns.set_style("whitegrid")
fig, axes = plt.subplots(1, 2, figsize=(14, 5))

# Histograma de distribuci√≥n de notas
axes[0].hist(df_notas['nota_final'].dropna(), bins=10, color='steelblue', edgecolor='black')
axes[0].set_xlabel('Nota Final')
axes[0].set_ylabel('Frecuencia')
axes[0].set_title('Distribuci√≥n de Notas Finales')
axes[0].grid(True, alpha=0.3)

# Top 5 cursos con m√°s estudiantes
df_top_cursos = df_notas.groupby('nombre_curso').size().sort_values(ascending=False).head(5)
axes[1].barh(range(len(df_top_cursos)), df_top_cursos.values, color='coral')
axes[1].set_yticks(range(len(df_top_cursos)))
axes[1].set_yticklabels(df_top_cursos.index)
axes[1].set_xlabel('Cantidad de Estudiantes')
axes[1].set_title('Top 5 Cursos con M√°s Estudiantes')
axes[1].grid(True, alpha=0.3, axis='x')

plt.tight_layout()
plt.show()

print("\n‚úÖ Visualizaci√≥n completada.")

conn.close()
print("\nüéì ¬°Examen Finalizado!")

NameError: name 'conn' is not defined